Revit 2027 API
Document.NewRooms2(Level, Phase) Method
 Creates new rooms in each plan circuit found in the given level in the given phase.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> NewRooms2(
	Level level,
	Phase phase
)
Public Function NewRooms2 (
	level As Level,
	phase As Phase
) As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ NewRooms2(
	Level^ level,
	Phase^ phase
)
member NewRooms2 :
        level : Level *
        phase : Phase -> ICollection<ElementId>
Parameters
level Level
 The level from which the circuits are found.
phase Phase
 The phase on which the room is to exist.
Return Value
ICollection<ElementId>
 If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  If the view of the relevant level can not be retrieved.
InvalidOperationException | If the phase is invalid, or regeneration fails at the end of the creation.
ArgumentException | Thrown if the level does not exist in the given document.
ArgumentException | Thrown if the phase does not exist in the given document.
See Also
Reference
Document Class
NewRooms2 Overload
Autodesk.Revit.Creation Namespace